bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.h
#ifndef __BL808_ISP_H__
#define __BL808_ISP_H__

#include "bl808_common.h"
#include "bl808_comm_mm.h"



#define ISP_AWB2_STA_Y_NUM        (5)
#define ISP_AWB2_STA_C_NUM        (8)
#define ISP_AE_HIST_Y_BIN_NUM     (257)
#define ISP_AE_HIST_BAYER_BIN_NUM (65)
#define ISP_AWB3_WEIGHT_NUM       (9)
#define ISP_AWB3_HIST_BIN_NUM_MAX (512)
#define ISP_EE_LUMA_WEIGHT_NUM    (32)
#define ISP_AWB3_CAL_BIN_NUM      (88)

#define AE_STATS_GRID_NUM_X   (12)
#define AE_STATS_GRID_NUM_Y   (8)
#define AE_STATS_GRID_NUM     ((AE_STATS_GRID_NUM_X)*(AE_STATS_GRID_NUM_Y))
#define AE_HIST_BIN_NUM       (256)
#define AE_METERING_TBL_NUM    (4)

/*
    ISP SYNC MODE
 */
typedef enum {
    ISP_SYNC_MODE_INPUT = 0,
    ISP_SYNC_MODE_OUTPUT,
    ISP_SYNC_MODE_OUTPUT_INPUT,
    ISP_SYNC_MODE_INPUT_VBLANK_NO_TOGGLE
}ISP_SYNC_MODE_TYPE;


/*
    R,Gr,Gb,B black level
*/
typedef struct blISP_CLAMP_S {
    int clamp_r;
    int clamp_gr;
    int clamp_gb;
    int clamp_b;
} ISP_CLAMP_S;

/*
    OB avg output R,Gr,Gb,B 
*/
typedef struct blISP_OB_S {
    int16_t ob_r;
    int16_t ob_gr;
    int16_t ob_gb;
    int16_t ob_b;
} ISP_OB_S;

/*
    Color Correction Matrix Coefficient
*/
typedef enum {
    ISP_CCM_11 = 0,
    ISP_CCM_12 = 1,
    ISP_CCM_13 = 2,
    ISP_CCM_21 = 3,
    ISP_CCM_22 = 4,
    ISP_CCM_23 = 5,
    ISP_CCM_31 = 6,
    ISP_CCM_32 = 7,
    ISP_CCM_33 = 8,
} ISP_CCM_COEF_TYPE_E;
    
typedef enum {
    ISP_CCM_OFFSET_0 = 0,
    ISP_CCM_OFFSET_1 = 1,
    ISP_CCM_OFFSET_2 = 2,
} ISP_CCM_CFFSET_TYPE_E;

typedef struct blISP_CCM_OFFSET_GROUP_S
{
    int offset[CCM_OFFSET_NUM];
} ISP_CCM_OFFSET_S;

typedef struct blISP_CCM_COEF_GROUP_S
{
    int ccm_coef[CCM_COEF_NUM];
} ISP_CCM_COEF_S;

typedef struct blISP_GAMMA_COEF_GROUP_S{
    uint16_t curve_coef[GAMMA_COEF_NUM];
} ISP_Gamma_Curve_Type;

/*
    YUV conversion mode
*/
typedef enum {
    ISP_YUV_CONV_FULL_SCALE = 0,
    ISP_YUV_CONV_BT601
}ISP_YUV_CONV_TYPE;

typedef struct blISP_SATURATION_S
{
    uint32_t saturation_cb;
    uint32_t saturation_cr;
} ISP_SATURATION_S;


/*
    Defect correction enhance state
*/
typedef enum {
    ISP_DPC_Enhance1 = 0,
    ISP_DPC_Enhance2,
    ISP_DPC_Enhance3,
    ISP_DPC_Enhance_Num  /* 3 */
}ISP_DPC_ENHANCE_TYPE;

/*
    Defect correction enhance state group
*/
typedef struct {
    BL_Fun_Type data[ISP_DPC_Enhance_Num];
}ISP_DPC_ENHANCE_GROUP_TYPE;

/*
    Defect correction threadhold
*/
typedef enum {
    ISP_DPC_th1 = 0,
    ISP_DPC_th2,
    ISP_DPC_th3,
    ISP_DPC_th4,
    ISP_DPC_th5,
    ISP_DPC_th_Num /* 5 */
}ISP_DPC_THRESHOLD_TYPE;

/*
    Defect correction threadhold group
*/
typedef struct {
    int data[ISP_DPC_th_Num];
}ISP_DPC_THRESHOLD_GROUP_TYPE;

/*
    Lens Shading Coef
    Acoef range: -4194304-4194303
    Bcoef range: -4096-4095
    Ccoef range: 0-255
    Dcoef range: -4194304-4194303
    Ecoef range: -4096-4095
    Gcoef range: -4194304-4194303
 */

typedef struct  {
    uint16_t th_base_r; // r/w, shadow, 10'b, range: 0 ~ (2 ^ TH_BW - 1)
    uint16_t th_base_g; // r/w, shadow, 10'b, range: 0 ~ (2 ^ TH_BW - 1)
    uint16_t th_base_b; // r/w, shadow, 10'b, range: 0 ~ (2 ^ TH_BW - 1)
    uint16_t th_slope_r; // r/w, shadow, 8'b, = TH_SLOPE_PRECISION, range: 0 ~ (2 ^ TH_SLOPE_PRECISION - 1)
    uint16_t th_slope_g; // r/w, shadow, 8'b, = TH_SLOPE_PRECISION, range: 0 ~ (2 ^ TH_SLOPE_PRECISION - 1)
    uint16_t th_slope_b; // r/w, shadow, 8'b, = TH_SLOPE_PRECISION, range: 0 ~ (2 ^ TH_SLOPE_PRECISION - 1)
    uint16_t slope_gain; // r/w, shadow, 6'b, = 2 + SLOPE_GAIN_PRECISION, 2.4 fixed-point, range: 0 ~ (2 ^ 6 - 1)
} ISP_BNR_THRESHOLD_TYPE;

typedef struct  {
    uint16_t fb_lpf_weight; // r/w, shadow, 5'b, = 1 + LPF_WEIGHT_PRECISION, range: 0 ~ (2 ^ LPF_WEIGHT_PRECISION)
    uint16_t fb_level;   // r/w, shadow, 3'b, = FB_LEVEL_BW, range: 0 ~ (2 ^ FB_LEVEL_BW - 1)
} ISP_BNR_FALLBACK_TYPE;

typedef struct {
    int coef[LSC_COEF_NUM];
}ISP_LSC_COEF_TYPE;

typedef struct blISP_LSC_COEF_S {
    ISP_LSC_COEF_TYPE lsc_coef_r;
    ISP_LSC_COEF_TYPE lsc_coef_g;
    ISP_LSC_COEF_TYPE lsc_coef_b;
} ISP_LSC_COEF_S;

typedef struct blISP_LSC_MAX_S {
    int max_r;
    int max_g;
    int max_b;
} ISP_LSC_MAX_S;

typedef enum {
    AE_GRID_DATA_RGB = 0,
    AE_GRID_DATA_Y = 1,
} AE_GRID_DATA_TYPE_E;

typedef enum {
    AWB_GRID_DATA_RG = 0,
    AWB_GRID_DATA_B = 1,
} AWB_GRID_DATA_TYPE_E;

typedef enum {
    ISP_CLK_160MHz = 0,
    ISP_CLK_240MHz = 1,
    ISP_CLK_400MHz = 2,
    ISP_CLK_BCLK = 3,
} ISP_CLK_SEL_E;


typedef struct {
    ISP_SYNC_MODE_TYPE      sync_mode_value;
    uint32_t                ISP_clk;
    uint32_t                pix_clk;
    uint16_t                fps;
    uint16_t                total_width;
    uint16_t                total_height;
    uint16_t                active_width;
    uint16_t                active_height;
    uint16_t                out_width;
    uint16_t                out_height;
} ISP_TG_Cfg_Type;

typedef struct {
    uint8_t                reg_act_vsync_rst_en;
    ISP_SYNC_MODE_TYPE     sync_mode;
    uint8_t                hsync_in_inv;
    uint8_t                vsync_in_inv;
    uint8_t                hcnt_rst_mode;
    uint8_t                vcnt_rst_mode;
    uint8_t                hblk_line_on;
    uint8_t                fhblk_line_on;
} ISP_DVP_MODE_CFG_T;

typedef struct _isp_ae_stats_conf {
    uint16_t            roi_start_x;
    uint16_t            roi_start_y;
    uint16_t            roi_width;
    uint16_t            roi_height;
    uint16_t            img_width;
    uint16_t            img_height;
    uint8_t             grid_width;
    uint8_t             grid_height;
    uint8_t             grid_num_x;
    uint8_t             grid_num_y;
} isp_ae_stats_conf_t;

typedef struct _isp_ae_sum {
    uint32_t            r_sum           :   8;
    uint32_t            g_sum           :   8;
    uint32_t            b_sum           :   8;
    uint32_t            reserved_24_31  :   8;
    uint32_t            y_sum           :   8;
    uint32_t            reserved_8_31   :   24;
} isp_ae_sum_t;

