bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.h
typedef enum {
    AE_HIST_MODE_BAYER = 0,
    AE_HIST_MODE_Y
} AE_HIST_MODE_TYPE_E;

typedef struct {
    uint16_t    ae_hist_x_min;
    uint16_t    ae_hist_x_max;
    uint16_t    ae_hist_y_min;
    uint16_t    ae_hist_y_max;
} isp_ae_hist_roi_t;

typedef struct _isp_awb_stats_conf {
    uint16_t            roi_start_x;
    uint16_t            roi_start_y;
    uint16_t            roi_width;
    uint16_t            roi_height;
    uint16_t            img_width;
    uint16_t            img_height;
    uint8_t             grid_width;
    uint8_t             grid_height;
    uint8_t             grid_num_x;
    uint8_t             grid_num_y;
    uint16_t            r_max_thr;
    uint16_t            r_min_thr;
    uint16_t            g_max_thr;
    uint16_t            g_min_thr;
    uint16_t            b_max_thr;
    uint16_t            b_min_thr;
} isp_awb_stats_conf_t;

typedef struct _isp_awb_sum{
    uint32_t r_sum          :  12;
    uint32_t reserved_12_15 :  4;
    uint32_t g_sum          :  12;
    uint32_t reserved_28_31 :  4;
    uint32_t b_sum          :  12;
    uint32_t reserved_12_31 :  20;
} isp_awb_sum_t;

typedef struct _isp_awb2_stats_conf {
    uint16_t    stat_x_min; // r/w, shadow, 11'b, range: 0 ~ (width - 1)
    uint16_t    stat_x_max; // r/w, shadow, 11'b, range: 0 ~ (width - 1)
    uint16_t    stat_y_min; // r/w, shadow, 11'b, range: 0 ~ (height - 1)
    uint16_t    stat_y_max; // r/w, shadow, 11'b, range: 0 ~ (height - 1)
    uint32_t    stat_pixel_num; // r/w, shadow, 21'b, = (stat_x_max - stat_x_min + 1) * (stat_y_max - stat_y_min + 1)
    uint16_t    stat_r_gain; // r/w, shadow, 16'b, = 4 + GAIN_PRECISION, 4.12 fixed-point, range: 0 ~ (2 ^ 16 - 1)
    uint16_t    stat_g_gain; // r/w, shadow, 16'b, = 4 + GAIN_PRECISION, 4.12 fixed-point, range: 0 ~ (2 ^ 16 - 1)
    uint16_t    stat_b_gain; // r/w, shadow, 16'b, = 4 + GAIN_PRECISION, 4.12 fixed-point, range: 0 ~ (2 ^ 16 - 1)
    uint16_t    stat_u_gain; // r/w, shadow, 10'b, = 2 + C_GAIN_PRECISION, 2.8 fixed-point, range: 0 ~ (2 ^ 10 - 1)
    uint16_t    stat_v_gain; // r/w, shadow, 10'b, = 2 + C_GAIN_PRECISION, 2.8 fixed-point, range: 0 ~ (2 ^ 10 - 1)
    uint16_t    reserved0;
    uint8_t     y_th[ISP_AWB2_STA_Y_NUM]; // r/w, shadow, 8'b, = STAT_PIXEL_BW, range: 0 ~ (2 ^ 8 - 1)
    uint8_t     y_weight[ISP_AWB2_STA_Y_NUM]; // r/w, shadow, 8'b, = STAT_PIXEL_BW, range: 0 ~ (2 ^ 8 - 1)
    uint16_t    reserved1;
    int16_t     y_slope[ISP_AWB2_STA_Y_NUM]; // r/w, shadow, 9'b, = 7 + SLOPE_PRECISION, signed 2's complement, range: -256 ~ +255
    uint16_t    reserved2;
    int8_t      u[ISP_AWB2_STA_C_NUM]; // r/w, shadow, 8'b, = STAT_PIXEL_BW, signed 2's complement, range: -128 ~ +127
    int8_t      v[ISP_AWB2_STA_C_NUM]; // r/w, shadow, 8'b, = STAT_PIXEL_BW, signed 2's complement, range: -128 ~ +127
    uint8_t     c_th[ISP_AWB2_STA_C_NUM]; // r/w, shadow, 6'b, = STAT_PIXEL_BW - 2, range: 0 ~ (2 ^ 6 - 1)
    uint8_t     c_slope[ISP_AWB2_STA_C_NUM]; // r/w, shadow, 8'b, = 6 + SLOPE_PRECISION, range: 0 ~ (2 ^ 8 - 1)
} isp_awb2_stats_conf_t;

typedef struct _isp_awb2_sum{
    uint32_t r_avg; // r, ping-pong, 12'b, = PIXEL_BW
    uint32_t g_avg; // r, ping-pong, 12'b, = PIXEL_BW
    uint32_t b_avg; // r, ping-pong, 12'b, = PIXEL_BW
    uint64_t white_r_sum; // r, ping-pong, 41'b, = max. width * height in bit + WEIGHT_PRECISION + PIXEL_BW
    uint64_t white_g_sum; // r, ping-pong, 41'b, = max. width * height in bit + WEIGHT_PRECISION + PIXEL_BW
    uint64_t white_b_sum; // r, ping-pong, 41'b, = max. width * height in bit + WEIGHT_PRECISION + PIXEL_BW
    uint32_t white_ratio; // r, ping-pong, 15'b, = 1 + RATIO_PRECISION, 1.14 fixed-point
} isp_awb2_sum_t;

typedef struct _isp_awb3_stats_conf {
    // control register
    // int8_t stat_en; // r/w, shadow, 1'b
    uint16_t stat_x_min; // r/w, shadow, 11'b, range: 0 ~ (width - 1), must be even
    uint16_t stat_x_max; // r/w, shadow, 11'b, range: 0 ~ (width - 1), must be odd
    uint16_t stat_y_min; // r/w, shadow, 11'b, range: 0 ~ (height - 1)
    uint16_t stat_y_max; // r/w, shadow, 11'b, range: 0 ~ (height - 1)
    uint16_t r_ratio_ofst; // r/w, shadow, 12'b, = RATIO_BW, 4.8 fixed-point, range: 0 ~ (2 ^ 12 - 1)
    uint16_t b_ratio_ofst; // r/w, shadow, 12'b, = RATIO_BW, 4.8 fixed-point, range: 0 ~ (2 ^ 12 - 1)
    uint16_t r_ratio_mult; // r/w, shadow, 12'b, integer, range: 0 ~ (2 ^ 12 - 1)
    uint16_t b_ratio_mult; // r/w, shadow, 12'b, integer, range: 0 ~ (2 ^ 12 - 1)
    uint16_t ratio_sum_min;  // r/w, shadow, 9'b, = NORM_BW + 1, range: 0 ~ (2 ^ 9 - 1)
    uint16_t ratio_sum_max; // r/w, shadow, 9'b, = NORM_BW + 1, range: 0 ~ (2 ^ 9 - 1)
    uint8_t g_divisor; // r/w, shadow, 1'b
    uint8_t weight_ratio_en; // r/w, shadow, 1'b
    uint8_t weight_ratio_gain; // r/w, shadow, 8'b, = WEIGHT_GAIN_BW, 4.4 fixed-point, range: 0 ~ (2 ^ 8 - 1)
    uint8_t _pad1[1];
    uint8_t weight_ratio[ISP_AWB3_WEIGHT_NUM][ISP_AWB3_WEIGHT_NUM]; // r/w, shadow, 8'b, = WEIGHT_BW, range: 0 ~ (2 ^ 8 - 1)
    uint8_t _pad2[3];
    uint16_t y_r_coeff; // r/w, shadow, 12'b, = COEFF_BW, 4.8 fixed-point, range: 0 ~ (2 ^ 12 - 1)
    uint16_t y_g_coeff; // r/w, shadow, 12'b, = COEFF_BW, 4.8 fixed-point, range: 0 ~ (2 ^ 12 - 1)
    uint16_t y_b_coeff; // r/w, shadow, 12'b, = COEFF_BW, 4.8 fixed-point, range: 0 ~ (2 ^ 12 - 1)
    uint8_t weight_y_use_g; // r/w, shadow, 1'b
    uint8_t weight_y_en; // r/w, shadow, 1'b
    uint8_t weight_y_gain; // r/w, shadow, 8'b, = WEIGHT_GAIN_BW, 4.4 fixed-point, range: 0 ~ (2 ^ 8 - 1)
    uint8_t _pad3[3];
    uint8_t weight_y[ISP_AWB3_WEIGHT_NUM][ISP_AWB3_WEIGHT_NUM]; // r/w, shadow, 8'b, = WEIGHT_BW, range: 0 ~ (2 ^ 8 - 1)
    uint8_t count_zero_weight; // r/w, shadow, 1'b
    uint8_t hist_y_use_g; // r/w, shadow, 1'b
    int32_t bin_pixel_clip; // r/w, shadow, 20'b, = PIXEL_NUM_BW, range: 0 ~ (2 ^ 20 - 1)
    uint8_t bin_y_level; // r/w, shadow, 3'b, range: 0 ~ 7
    uint8_t bin_ratio_level; // r/w, shadow, 3'b, range: 0 ~ 4
    uint8_t bin_clip_en; // r/w, shadow, 1'b
    uint8_t bin_mode; // r/w, shadow, 2'b, range: 0 ~ 3
    uint8_t ink_type; // r/w, shadow, 2'b, range: 0 ~ 2
    uint8_t ink_gain; // r/w, shadow, 4'b, integer, range: 0 ~ (2 ^ 4 - 1)
} isp_awb3_stats_conf_t;

