bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.h
typedef struct _isp_awb3_sum{
    // status register
    uint32_t r_sum; // r, ping-pong, 32'b, = PIXEL_NUM_BW + PIXEL_BW
    uint32_t g_sum; // r, ping-pong, 32'b, = PIXEL_NUM_BW + PIXEL_BW
    uint32_t b_sum; // r, ping-pong, 32'b, = PIXEL_NUM_BW + PIXEL_BW
    uint32_t r_sum_hex; // r, ping-pong, 32'b, = PIXEL_NUM_BW + PIXEL_BW
    uint32_t g_sum_hex; // r, ping-pong, 32'b, = PIXEL_NUM_BW + PIXEL_BW
    uint32_t b_sum_hex; // r, ping-pong, 32'b, = PIXEL_NUM_BW + PIXEL_BW
    uint32_t pixel_hex; // r, ping-pong, 20'b, = PIXEL_NUM_BW
    uint64_t r_ratio_hex_y; // r, ping-pong, 40'b, = PIXEL_NUM_BW + WEIGHT_BW + RATIO_BW
    uint64_t b_ratio_hex_y; // r, ping-pong, 40'b, = PIXEL_NUM_BW + WEIGHT_BW + RATIO_BW
    uint32_t weight_hex_y; // r, ping-pong, 28'b, = PIXEL_NUM_BW + WEIGHT_BW
    uint32_t pixel_hex_y; // r, ping-pong, 20'b, = PIXEL_NUM_BW
    uint64_t r_ratio_hist; // r, ping-pong, 40'b, = PIXEL_NUM_BW + WEIGHT_BW + RATIO_BW
    uint64_t b_ratio_hist; // r, ping-pong, 40'b, = PIXEL_NUM_BW + WEIGHT_BW + RATIO_BW
    uint32_t weight_hist; // r, ping-pong, 28'b, = PIXEL_NUM_BW + WEIGHT_BW
    uint32_t pixel_hist; // r, ping-pong, 20'b, = PIXEL_NUM_BW
    uint64_t r_ratio_hist_clip; // r, ping-pong, 40'b, = PIXEL_NUM_BW + WEIGHT_BW + RATIO_BW
    uint64_t b_ratio_hist_clip; // r, ping-pong, 40'b, = PIXEL_NUM_BW + WEIGHT_BW + RATIO_BW
    uint32_t weight_hist_clip; // r, ping-pong, 28'b, = PIXEL_NUM_BW + WEIGHT_BW
    uint32_t pixel_hist_clip; // r, ping-pong, 20'b, = PIXEL_NUM_BW
} isp_awb3_sum_t;

typedef struct _isp_awb3_bucket{
    int32_t footprint[4];
} isp_awb3_bucket_t;

typedef enum {
    AWB3_BIN_MODE_FULL = 0,
    AWB3_BIN_MODE_RATIO,
    AWB3_BIN_MODE_Y,
    AWB3_BIN_MODE_NONE,
} isp_awb3_bin_mode_e;

typedef struct _isp_af_stats_conf{
    int16_t wa_hpf1_sum;
    int16_t wa_hpf2_sum;
    int16_t wb_hpf1_sum;
    int16_t wb_hpf2_sum;
} isp_af_stats_conf_t;

typedef struct {
    uint8_t  dirShpnessThresh;
    uint8_t  noDirShpnessThresh;
    uint8_t  flatThresh;
    uint16_t textureThresh;
    uint16_t edgeThresh;
} ISP_EE_Thresh_Type;

typedef struct {
    uint8_t posEdgeOvrshtStr;
    uint8_t negEdgeOvrshtStr;
    uint8_t posEdgeStr;
    uint8_t negEdgeStr;
    uint8_t nrStr;
} ISP_EE_Str_Type;

typedef struct {
    uint16_t lumaWgtTbl[ISP_EE_LUMA_WEIGHT_NUM];
} ISP_EE_Luma_Weight_Type;

typedef struct {
    uint16_t gain;
    uint8_t  weight;
    uint8_t  grey_thr;
} ISP_Chroma_Suppress_Type;

typedef struct {
    uint16_t r_gain;
    uint16_t g_gain;
    uint16_t b_gain;
} ISP_RGB_Gain_Type;

typedef struct {
    uint16_t r_offset;
    uint16_t g_offset;
    uint16_t b_offset;
} ISP_RGB_Offset_Type;

typedef struct {
    uint16_t r_gain;
    uint16_t b_gain;
} ISP_RB_Gain_Type;

typedef struct {
    uint8_t gamma_pattern;
    uint8_t fcore1;
    uint8_t fcore2;
} ISP_AF_CONF_Type;

typedef struct {
    uint8_t start_x;
    uint8_t start_y;
    uint8_t end_x;
    uint8_t end_y;
    uint8_t sum_shift;
} ISP_AF_WINDOW_Type;

#define IS_ISP_YUV_CONV_TYPE(type)                      (((type) == ISP_YUV_CONV_FULL_SCALE) || \
                                                          ((type) == ISP_YUV_CONV_BT601))

void ISP_Init(void);

void ISP_Get_IP_Info(int *version, int *ip_id);
void ISP_Set_TG_Cfg(const ISP_TG_Cfg_Type *cfg);
void ISP_Set_TG_Reshape_Cfg();

void ISP_Set_DVP_Mode_Cfg(ISP_DVP_MODE_CFG_T *cfg);
void ISP_Get_DVP_Mode_Cfg(ISP_DVP_MODE_CFG_T *cfg);
void ISP_Set_Total_Pixels(BL_Img_Size_T *out_win);
void ISP_Get_Total_Pixels(BL_Img_Size_T *out_win);
void ISP_Set_Active_Pixels(int start_pixel, int start_line, BL_Img_Size_T *out_win);
void ISP_Get_Active_Pixels(int *start_pixel, int *start_line, BL_Img_Size_T *out_win);
void ISP_Set_Output_Pixels(int start_pixel, int start_line, BL_Img_Size_T *out_win);
void ISP_Get_Output_Pixels(int *start_pixel, int *start_line, BL_Img_Size_T *out_win);
void ISP_Set_Hsync_Pixels(int start_pixel, int start_line, BL_Img_Size_T *out_win);
void ISP_Get_Hsync_Pixels(int *start_pixel, int *start_line, BL_Img_Size_T *out_win);
void ISP_Set_Vsync_Pixels(int start_pixel, int start_line, int end_pixel, int line_height);
void ISP_Get_Vsync_Pixels(int *start_pixel, int *start_line, int *end_pixel, int *line_height);
void ISP_Set_Bayer_Pattern(const BAYER_PATTERN_E pattern);
void ISP_Get_Bayer_Pattern(BAYER_PATTERN_E *pattern);

void ISP_Set_AE_State(BL_Fun_Type state);
void ISP_Set_AE_Stats_Conf(const isp_ae_stats_conf_t *ae_stats_conf);
void ISP_Get_AE_Stats_Conf(isp_ae_stats_conf_t *ae_stats_conf);
void ISP_Get_AE_Sum(int grid_idx, AE_GRID_DATA_TYPE_E data_type, uint32_t *data);
void ISP_Set_AE_Ysum_Coeff(uint8_t coeff_r, uint8_t coeff_g, uint8_t coeff_b);
void ISP_Get_AE_Ysum_Coeff(uint8_t *coeff_r, uint8_t *coeff_g, uint8_t *coeff_b);
int  ISP_Get_AE_Stats(int grid_num, uint32_t *data);

void ISP_Set_AE_Hist_State(BL_Fun_Type state);
int  ISP_Get_AE_Hist_State(BL_Fun_Type *state);
void ISP_Set_AE_Hist_Mode(AE_HIST_MODE_TYPE_E mode);
int  ISP_Get_AE_Hist_Mode(AE_HIST_MODE_TYPE_E *mode);
void ISP_Set_AE_Hist_ROI_State(BL_Fun_Type state);
int  ISP_Get_AE_Hist_ROI_State(BL_Fun_Type *state);
int  ISP_Set_AE_Hist_ROI(BL_Fun_Type state, const isp_ae_hist_roi_t *roi);
int  ISP_Get_AE_Hist_ROI(BL_Fun_Type state, isp_ae_hist_roi_t *roi);
int  ISP_Get_AE_Hist_SUM_Y(uint32_t *y_sum);
int  ISP_Get_AE_Hist_SUM_Bayer(uint32_t *r_sum, uint32_t *gr_sum, uint32_t *gb_sum, uint32_t *b_sum);

void ISP_Set_AWB_State(BL_Fun_Type state);
int  ISP_Get_AWB_Stats(int grid_num, uint32_t *data);
void ISP_Set_AWB_Stats_Conf(const isp_awb_stats_conf_t *awb_stats_conf);
void ISP_Get_AWB_Stats_Conf(isp_awb_stats_conf_t *awb_stats_conf);
void ISP_Get_AWB_Sum(int grid_idx, RGB_SUM_S *rgb_sum);
void ISP_Get_AWB_ValidGridNum(int *valid_grid_num);

void ISP_Set_AWB_Gain(const ISP_RGB_Gain_Type* rgb_gain);
void ISP_Get_AWB_Gain(ISP_RGB_Gain_Type *rgb_gain);
void ISP_Set_AWB_Offset(const ISP_RGB_Offset_Type *Offset);
void ISP_Get_AWB_Offset(ISP_RGB_Offset_Type *Offset);
void ISP_Set_RB_Gain(const ISP_RB_Gain_Type *rb_gain);

void ISP_Set_AWB2_Stats_State(BL_Fun_Type state);
void ISP_Set_AWB2_Stats_Conf(const isp_awb2_stats_conf_t *awb_stats_conf);
int  ISP_Get_AWB2_Sum(isp_awb2_sum_t *sum);
void ISP_Set_AWB2_Gain_State(BL_Fun_Type state);
void ISP_Set_AWB2_Gain(const ISP_RGB_Gain_Type *gain);
void ISP_Get_AWB2_Gain(ISP_RGB_Gain_Type *rgb_gain);

void ISP_Set_AWB3_Hist_State(BL_Fun_Type state);
void ISP_Get_AWB3_Hist_State(BL_Fun_Type *state);
void ISP_Set_AWB3_Stats_Conf(const isp_awb3_stats_conf_t *awb_stats_conf);
void ISP_Get_AWB3_Stats_Conf(isp_awb3_stats_conf_t *awb_stats_conf);
int  ISP_Get_AWB3_Sum(isp_awb3_sum_t *sum);
int  ISP_Get_AWB3_Bin_Mode(isp_awb3_bin_mode_e *mode);
void ISP_Set_AWB3_Bin_Mode(isp_awb3_bin_mode_e mode);
int  ISP_Get_AWB3_Hist_Bin_Num(uint32_t *num);
int  ISP_Get_AWB3_Hist(uint32_t *data);
int  ISP_Get_AWB3_G_Divisor(int *value);
void ISP_Set_AWB3_G_Divisor(int value);

int  ISP_Set_Output_Window(BL_Img_Size_T *out_win);
int  ISP_Get_Output_Window(BL_Img_Size_T *out_win);
void ISP_Set_BL444to422(int mode);
void ISP_Get_BL444to422(int *mode);


