bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/bl808_isp.h
/*
    Set R/G/B BLC
    value range:
        0-1023
 */
int ISP_Set_BLC(const ISP_CLAMP_S *clamp);
int ISP_Get_BLC(ISP_CLAMP_S *clamp);
int ISP_Get_OB_Avg(ISP_OB_S *ob);

void ISP_Set_DPC_State(BL_Fun_Type state);
void ISP_Get_DPC_State(BL_Fun_Type *state);
void ISP_Enable_DPC(void);
void ISP_Disable_DPC(void);
int  ISP_Set_Defect_Correction_Enhance_Group(const ISP_DPC_ENHANCE_GROUP_TYPE *value);
int  ISP_Get_Defect_Correction_Enhance_Group(ISP_DPC_ENHANCE_GROUP_TYPE *value);
int  ISP_Set_Defect_Correction_Threshold_Group(const ISP_DPC_THRESHOLD_GROUP_TYPE *value);
int  ISP_Get_Defect_Correction_Threshold_Group(ISP_DPC_THRESHOLD_GROUP_TYPE *value);
int  ISP_Set_Defect_Postion(const int pos_x, const int pos_y);
int  ISP_Get_Defect_Postion(int *pos_x, int *pos_y);

void ISP_Set_BNR_State(BL_Fun_Type state);
void ISP_Get_BNR_State(BL_Fun_Type *state);
void ISP_Set_BNR_Weight(int value);
void ISP_Get_BNR_Weight(int *value);
void ISP_Set_BNR_LPF_Weight(int value);
void ISP_Get_BNR_LPF_Weight(int *value);
void ISP_Set_BNR_Threshold(const ISP_BNR_THRESHOLD_TYPE *value);
void ISP_Get_BNR_Threshold(ISP_BNR_THRESHOLD_TYPE *value);
void ISP_Set_BNR_Fallback(const ISP_BNR_FALLBACK_TYPE *value);
void ISP_Get_BNR_Fallback(ISP_BNR_FALLBACK_TYPE *value);

void ISP_Set_Brightness(int value);
void ISP_Get_Brightness(int *value);

void ISP_Set_LSC_State(BL_Fun_Type state);
void ISP_Enable_LSC(void);
void ISP_Disable_LSC(void);
void ISP_Get_LSC_State(BL_Fun_Type *state);
/*
    Set Lens Shading Correction offset
*/
int ISP_Set_LSC_Offset(int xoffset, int yoffset);
int ISP_Get_LSC_Offset(int *xoffset, int *yoffset);

/*
    Set/Get Lens Shading Correction setting
    value range: please see ISP_LSC_COEF_S
*/
int ISP_Set_LSC_Coeff(const ISP_LSC_COEF_S *lsc);
int ISP_Get_LSC_Coeff(ISP_LSC_COEF_S *lsc);
int ISP_Set_LSC_Coeff_Type(const int type_idx, ISP_LSC_COEF_TYPE *lsc);
int ISP_Get_LSC_Coeff_Type(const int type_idx, ISP_LSC_COEF_TYPE *lsc);

/*
    Set/Get Lens Shading Correction R,G,B MAX
    value range: 0-255 (refs to demo app)
*/
int ISP_Set_LSC_Max(const ISP_LSC_MAX_S *lsc_max);
int ISP_Get_LSC_Max(ISP_LSC_MAX_S *lsc_max);

void ISP_Set_Digital_Gain(int r_gain, int gr_gain, int gb_gain, int b_gain);
void ISP_Get_Digital_Gain(int *r_gain, int *gr_gain, int *gb_gain, int *b_gain);

void ISP_Set_CFA_Int_State(BL_Fun_Type state);
void ISP_Get_CFA_Int_State(BL_Fun_Type *state);

void ISP_Set_CCM_State(BL_Fun_Type state);
void ISP_Get_CCM_State(BL_Fun_Type *state);

/*
    Set/Get Color Correction Matrix Coefficient Value
    value range: 0-4095, 512 normalize to 1
 */
void  ISP_Set_CCM_Coef(const ISP_CCM_COEF_S *ccm);
void  ISP_Get_CCM_Coef(ISP_CCM_COEF_S *ccm);
void ISP_Set_CCM_Pre_Offset(const ISP_CCM_OFFSET_S *ccm);
void ISP_Get_CCM_Pre_Offset(ISP_CCM_OFFSET_S *ccm);
void ISP_Set_CCM_Post_Offset(const ISP_CCM_OFFSET_S *ccm);
void ISP_Get_CCM_Post_Offset(ISP_CCM_OFFSET_S *ccm);


void ISP_Set_Gamma_State(BL_Fun_Type state);
void ISP_Get_Gamma_State(BL_Fun_Type *state);

/*
    Set/Get Gamma
    value range: 0-4095
 */
void ISP_Set_Gamma_Coef(const ISP_Gamma_Curve_Type *gamma_curve);
void ISP_Get_Gamma_Coef(ISP_Gamma_Curve_Type *gamma_curve);


void ISP_Init_Color_Enhancement();
/*
    Set/Get YUV Conversion mode
    @ deprecated
    if you want to change the yuv range, please set yuv adjust
 */
void ISP_Set_YUV_Conv_Mode(ISP_YUV_CONV_TYPE  type);
void ISP_Get_YUV_Conv_Mode(ISP_YUV_CONV_TYPE *type);


/*
    Set/Get Brightness
    value range: TODO  -128-127
 */
void ISP_Set_Brightness(int value);
void ISP_Get_Brightness(int *value);

/*
    Set/Get Contrast
    value range: TODO 0-255
*/
void ISP_Set_Contrast(int value);
void ISP_Get_Contrast(int *value);

/*
    Set/Get Saturation
    value range:TODO  0-255
*/
void ISP_Set_Saturation(const ISP_SATURATION_S *saturation);
void ISP_Get_Saturation(ISP_SATURATION_S *saturation);

void ISP_Set_Special_Mode(int value);
void ISP_Get_Special_Mode(int *value);
void ISP_Set_LPF_Filting_Mode(int value);
void ISP_Get_LPF_Filting_Mode(int *value);
void ISP_Set_Sepia(int SepiaCr, int SepiaCb);
void ISP_Get_Sepia(int *SepiaCr, int *SepiaCb);
void ISP_Set_Solar_Thred(int value);
void ISP_Get_Solar_Thred(int *value);

/*
    Set/Get Noise Level
    value range: 0-63
*/
void ISP_Set_Noise_Level(int value);
void ISP_Get_Noise_Level(int *value);

/*
    Set/Get 2D Noise Reduction
    value range: 0-31
*/
void ISP_Set_2D_NR(int value);
void ISP_Get_2D_NR(int *value);

/*
    Set/Get 3D Noise Reduction
    value range: 0-31
*/
void ISP_Set_3D_NR(int value);
void ISP_Get_3D_NR(int *value);
void ISP_Set_NR_HSize(const int value);
void ISP_Get_NR_HSize(int *value);

void ISP_Set_EE_State(BL_Fun_Type state);
void ISP_Get_EE_State(BL_Fun_Type *state);
void ISP_Enable_EE(void);
void ISP_Disable_EE(void);
void ISP_EnableEEOverShoot(void);
void ISP_DisableEEOverShoot(void);
void ISP_Set_EEOverShoot_State(BL_Fun_Type state);
void ISP_Get_EEOverShoot_State(BL_Fun_Type *state);
void ISP_Set_EE_Thresh(const ISP_EE_Thresh_Type *threshCfg);
void ISP_Get_EE_Thresh(ISP_EE_Thresh_Type *threshCfg);
void ISP_Set_EE_Strength(const ISP_EE_Str_Type *strCfg);
void ISP_Get_EE_Strength(ISP_EE_Str_Type *strCfg);
void ISP_Set_EE_LumaWeight(const ISP_EE_Luma_Weight_Type *lumaWgtCfg);
void ISP_Get_EE_LumaWeight(ISP_EE_Luma_Weight_Type *lumaWgtCfg);

void ISP_Set_ChromaSuppress_State(BL_Fun_Type state);
void ISP_Get_ChromaSuppress_State(BL_Fun_Type *state);
void ISP_Enable_ChromaSuppress(void);
void ISP_Disable_ChromaSuppress(void);

void ISP_Set_ChromaSuppress(const ISP_Chroma_Suppress_Type *chromaSupprCfg);
void ISP_Get_ChromaSuppress(ISP_Chroma_Suppress_Type *chromaSupprCfg);

void ISP_Get_AF_Stats(isp_af_stats_conf_t *afStats);
void ISP_Set_AF_Stats_Conf(const ISP_AF_CONF_Type *afCfg);
void ISP_Get_AF_Stats_Conf(ISP_AF_CONF_Type *afCfg);
void ISP_Set_AF_Window_A(const ISP_AF_WINDOW_Type *afWinCfg);
void ISP_Get_AF_Window_A(ISP_AF_WINDOW_Type *afWinCfg);
void ISP_Set_AF_Window_B(const ISP_AF_WINDOW_Type *afWinCfg);
void ISP_Get_AF_Window_B(ISP_AF_WINDOW_Type *afWinCfg);

void ISP_SW_Reset(void);
void ISP_Clock_Sel(ISP_CLK_SEL_E clk_sel, BL_Fun_Type clk_div_en, int clk_div);
void ISP_Enable(void);
void ISP_Disable(void);

#endif  /* __BL808_ISP_H__ */
